zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_DSPSS.h
/*! @name DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL - DSP ACK Timeout Configuration And Error Control */
/*! @{ */

#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_TIMER_MASK (0x3FU)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_TIMER_SHIFT (0U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_TIMER_WIDTH (6U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_TIMER(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_TIMER_SHIFT)) & DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_TIMER_MASK)

#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_EN_MASK (0x40U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_EN_SHIFT (6U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_EN_WIDTH (1U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_EN(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_EN_SHIFT)) & DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_EN_MASK)

#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_MASK (0x100U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_SHIFT (8U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_WIDTH (1U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_SHIFT)) & DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_MASK)

#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_REQ_ACC_FIFO_THRESHOLD_FOR_INTR_MASK (0x3E00U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_REQ_ACC_FIFO_THRESHOLD_FOR_INTR_SHIFT (9U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_REQ_ACC_FIFO_THRESHOLD_FOR_INTR_WIDTH (5U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_REQ_ACC_FIFO_THRESHOLD_FOR_INTR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_REQ_ACC_FIFO_THRESHOLD_FOR_INTR_SHIFT)) & DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_REQ_ACC_FIFO_THRESHOLD_FOR_INTR_MASK)

#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_REQ_ACC_FIFO_INTR_MASK (0x4000U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_REQ_ACC_FIFO_INTR_SHIFT (14U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_REQ_ACC_FIFO_INTR_WIDTH (1U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_REQ_ACC_FIFO_INTR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_REQ_ACC_FIFO_INTR_SHIFT)) & DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_REQ_ACC_FIFO_INTR_MASK)

#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_REQ_COUNT_ACC_FIFO_MASK (0xF8000U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_REQ_COUNT_ACC_FIFO_SHIFT (15U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_REQ_COUNT_ACC_FIFO_WIDTH (5U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_REQ_COUNT_ACC_FIFO(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_REQ_COUNT_ACC_FIFO_SHIFT)) & DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_REQ_COUNT_ACC_FIFO_MASK)

#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_TH0_MASK (0x100000U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_TH0_SHIFT (20U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_TH0_WIDTH (1U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_TH0(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_TH0_SHIFT)) & DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_TH0_MASK)

#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_TH1_MASK (0x200000U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_TH1_SHIFT (21U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_TH1_WIDTH (1U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_TH1(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_TH1_SHIFT)) & DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_TH1_MASK)

#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_TH2_MASK (0x400000U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_TH2_SHIFT (22U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_TH2_WIDTH (1U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_TH2(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_TH2_SHIFT)) & DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_TH2_MASK)

#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_TH3_MASK (0x800000U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_TH3_SHIFT (23U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_TH3_WIDTH (1U)
#define DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_TH3(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_TH3_SHIFT)) & DSPSS_DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL_DSP_ACK_TIMEOUT_ERR_TH3_MASK)
/*! @} */

/*! @name ECC_ERROR_MONITOR_THREAD_SUSPEND_CTRL - Disable Monitoring of ECC Errors In XMEM And PMEM */
/*! @{ */

#define DSPSS_ECC_ERROR_MONITOR_THREAD_SUSPEND_CTRL_XMEM_EVEN_ECC_ERROR_DIS_MASK (0x1U)
#define DSPSS_ECC_ERROR_MONITOR_THREAD_SUSPEND_CTRL_XMEM_EVEN_ECC_ERROR_DIS_SHIFT (0U)
#define DSPSS_ECC_ERROR_MONITOR_THREAD_SUSPEND_CTRL_XMEM_EVEN_ECC_ERROR_DIS_WIDTH (1U)
#define DSPSS_ECC_ERROR_MONITOR_THREAD_SUSPEND_CTRL_XMEM_EVEN_ECC_ERROR_DIS(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_ECC_ERROR_MONITOR_THREAD_SUSPEND_CTRL_XMEM_EVEN_ECC_ERROR_DIS_SHIFT)) & DSPSS_ECC_ERROR_MONITOR_THREAD_SUSPEND_CTRL_XMEM_EVEN_ECC_ERROR_DIS_MASK)

#define DSPSS_ECC_ERROR_MONITOR_THREAD_SUSPEND_CTRL_XMEM_ODD_ECC_ERROR_DIS_MASK (0x2U)
#define DSPSS_ECC_ERROR_MONITOR_THREAD_SUSPEND_CTRL_XMEM_ODD_ECC_ERROR_DIS_SHIFT (1U)
#define DSPSS_ECC_ERROR_MONITOR_THREAD_SUSPEND_CTRL_XMEM_ODD_ECC_ERROR_DIS_WIDTH (1U)
#define DSPSS_ECC_ERROR_MONITOR_THREAD_SUSPEND_CTRL_XMEM_ODD_ECC_ERROR_DIS(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_ECC_ERROR_MONITOR_THREAD_SUSPEND_CTRL_XMEM_ODD_ECC_ERROR_DIS_SHIFT)) & DSPSS_ECC_ERROR_MONITOR_THREAD_SUSPEND_CTRL_XMEM_ODD_ECC_ERROR_DIS_MASK)

#define DSPSS_ECC_ERROR_MONITOR_THREAD_SUSPEND_CTRL_PMEM_ECC_ERROR_DIS_MASK (0x4U)
#define DSPSS_ECC_ERROR_MONITOR_THREAD_SUSPEND_CTRL_PMEM_ECC_ERROR_DIS_SHIFT (2U)
#define DSPSS_ECC_ERROR_MONITOR_THREAD_SUSPEND_CTRL_PMEM_ECC_ERROR_DIS_WIDTH (1U)
#define DSPSS_ECC_ERROR_MONITOR_THREAD_SUSPEND_CTRL_PMEM_ECC_ERROR_DIS(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_ECC_ERROR_MONITOR_THREAD_SUSPEND_CTRL_PMEM_ECC_ERROR_DIS_SHIFT)) & DSPSS_ECC_ERROR_MONITOR_THREAD_SUSPEND_CTRL_PMEM_ECC_ERROR_DIS_MASK)
/*! @} */

/*! @name INTERRUPT_ENABLE_REGISTER2 - Interrupt Enable */
/*! @{ */

