zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_DSPSS.h
#define DSPSS_DSPSS_DSP_IO_INTF0_DSP_TRIGGER_CORE_TH0_MASK (0x1U)
#define DSPSS_DSPSS_DSP_IO_INTF0_DSP_TRIGGER_CORE_TH0_SHIFT (0U)
#define DSPSS_DSPSS_DSP_IO_INTF0_DSP_TRIGGER_CORE_TH0_WIDTH (1U)
#define DSPSS_DSPSS_DSP_IO_INTF0_DSP_TRIGGER_CORE_TH0(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSPSS_DSP_IO_INTF0_DSP_TRIGGER_CORE_TH0_SHIFT)) & DSPSS_DSPSS_DSP_IO_INTF0_DSP_TRIGGER_CORE_TH0_MASK)

#define DSPSS_DSPSS_DSP_IO_INTF0_DSP_TRIGGER_CORE_TH1_MASK (0x2U)
#define DSPSS_DSPSS_DSP_IO_INTF0_DSP_TRIGGER_CORE_TH1_SHIFT (1U)
#define DSPSS_DSPSS_DSP_IO_INTF0_DSP_TRIGGER_CORE_TH1_WIDTH (1U)
#define DSPSS_DSPSS_DSP_IO_INTF0_DSP_TRIGGER_CORE_TH1(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSPSS_DSP_IO_INTF0_DSP_TRIGGER_CORE_TH1_SHIFT)) & DSPSS_DSPSS_DSP_IO_INTF0_DSP_TRIGGER_CORE_TH1_MASK)

#define DSPSS_DSPSS_DSP_IO_INTF0_DSP_TRIGGER_CORE_TH2_MASK (0x4U)
#define DSPSS_DSPSS_DSP_IO_INTF0_DSP_TRIGGER_CORE_TH2_SHIFT (2U)
#define DSPSS_DSPSS_DSP_IO_INTF0_DSP_TRIGGER_CORE_TH2_WIDTH (1U)
#define DSPSS_DSPSS_DSP_IO_INTF0_DSP_TRIGGER_CORE_TH2(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSPSS_DSP_IO_INTF0_DSP_TRIGGER_CORE_TH2_SHIFT)) & DSPSS_DSPSS_DSP_IO_INTF0_DSP_TRIGGER_CORE_TH2_MASK)

#define DSPSS_DSPSS_DSP_IO_INTF0_DSP_TRIGGER_CORE_TH3_MASK (0x8U)
#define DSPSS_DSPSS_DSP_IO_INTF0_DSP_TRIGGER_CORE_TH3_SHIFT (3U)
#define DSPSS_DSPSS_DSP_IO_INTF0_DSP_TRIGGER_CORE_TH3_WIDTH (1U)
#define DSPSS_DSPSS_DSP_IO_INTF0_DSP_TRIGGER_CORE_TH3(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSPSS_DSP_IO_INTF0_DSP_TRIGGER_CORE_TH3_SHIFT)) & DSPSS_DSPSS_DSP_IO_INTF0_DSP_TRIGGER_CORE_TH3_MASK)
/*! @} */

/*! @name CURR_ACTIVE_THRD - DSP Core Status */
/*! @{ */

#define DSPSS_CURR_ACTIVE_THRD_CURR_ACTIVE_THREAD_MASK (0xFU)
#define DSPSS_CURR_ACTIVE_THRD_CURR_ACTIVE_THREAD_SHIFT (0U)
#define DSPSS_CURR_ACTIVE_THRD_CURR_ACTIVE_THREAD_WIDTH (4U)
#define DSPSS_CURR_ACTIVE_THRD_CURR_ACTIVE_THREAD(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_CURR_ACTIVE_THRD_CURR_ACTIVE_THREAD_SHIFT)) & DSPSS_CURR_ACTIVE_THRD_CURR_ACTIVE_THREAD_MASK)

#define DSPSS_CURR_ACTIVE_THRD_DSP_INIT_COMP_MASK (0x10U)
#define DSPSS_CURR_ACTIVE_THRD_DSP_INIT_COMP_SHIFT (4U)
#define DSPSS_CURR_ACTIVE_THRD_DSP_INIT_COMP_WIDTH (1U)
#define DSPSS_CURR_ACTIVE_THRD_DSP_INIT_COMP(x)  (((uint32_t)(((uint32_t)(x)) << DSPSS_CURR_ACTIVE_THRD_DSP_INIT_COMP_SHIFT)) & DSPSS_CURR_ACTIVE_THRD_DSP_INIT_COMP_MASK)

#define DSPSS_CURR_ACTIVE_THRD_DSP_THRD_SLEEP_STATUS_MASK (0x3C0U)
#define DSPSS_CURR_ACTIVE_THRD_DSP_THRD_SLEEP_STATUS_SHIFT (6U)
#define DSPSS_CURR_ACTIVE_THRD_DSP_THRD_SLEEP_STATUS_WIDTH (4U)
#define DSPSS_CURR_ACTIVE_THRD_DSP_THRD_SLEEP_STATUS(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_CURR_ACTIVE_THRD_DSP_THRD_SLEEP_STATUS_SHIFT)) & DSPSS_CURR_ACTIVE_THRD_DSP_THRD_SLEEP_STATUS_MASK)

#define DSPSS_CURR_ACTIVE_THRD_LAST_CTXT_REQ_MASK (0x3C00U)
#define DSPSS_CURR_ACTIVE_THRD_LAST_CTXT_REQ_SHIFT (10U)
#define DSPSS_CURR_ACTIVE_THRD_LAST_CTXT_REQ_WIDTH (4U)
#define DSPSS_CURR_ACTIVE_THRD_LAST_CTXT_REQ(x)  (((uint32_t)(((uint32_t)(x)) << DSPSS_CURR_ACTIVE_THRD_LAST_CTXT_REQ_SHIFT)) & DSPSS_CURR_ACTIVE_THRD_LAST_CTXT_REQ_MASK)

#define DSPSS_CURR_ACTIVE_THRD_DSP_COMP_LOW_MASK (0x4000U)
#define DSPSS_CURR_ACTIVE_THRD_DSP_COMP_LOW_SHIFT (14U)
#define DSPSS_CURR_ACTIVE_THRD_DSP_COMP_LOW_WIDTH (1U)
#define DSPSS_CURR_ACTIVE_THRD_DSP_COMP_LOW(x)   (((uint32_t)(((uint32_t)(x)) << DSPSS_CURR_ACTIVE_THRD_DSP_COMP_LOW_SHIFT)) & DSPSS_CURR_ACTIVE_THRD_DSP_COMP_LOW_MASK)
/*! @} */

/*! @name DSPSS_DSP_CORE_TRIGGER_SAFETY - >DSP Safety Trigger to Core..DSP Safety Trigger to Core */
/*! @{ */

#define DSPSS_DSPSS_DSP_CORE_TRIGGER_SAFETY_DSP_TRIGGER_SAFETY_1_MASK (0x1U)
#define DSPSS_DSPSS_DSP_CORE_TRIGGER_SAFETY_DSP_TRIGGER_SAFETY_1_SHIFT (0U)
#define DSPSS_DSPSS_DSP_CORE_TRIGGER_SAFETY_DSP_TRIGGER_SAFETY_1_WIDTH (1U)
#define DSPSS_DSPSS_DSP_CORE_TRIGGER_SAFETY_DSP_TRIGGER_SAFETY_1(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSPSS_DSP_CORE_TRIGGER_SAFETY_DSP_TRIGGER_SAFETY_1_SHIFT)) & DSPSS_DSPSS_DSP_CORE_TRIGGER_SAFETY_DSP_TRIGGER_SAFETY_1_MASK)

#define DSPSS_DSPSS_DSP_CORE_TRIGGER_SAFETY_DSP_TRIGGER_SAFETY_2_MASK (0x2U)
#define DSPSS_DSPSS_DSP_CORE_TRIGGER_SAFETY_DSP_TRIGGER_SAFETY_2_SHIFT (1U)
#define DSPSS_DSPSS_DSP_CORE_TRIGGER_SAFETY_DSP_TRIGGER_SAFETY_2_WIDTH (1U)
#define DSPSS_DSPSS_DSP_CORE_TRIGGER_SAFETY_DSP_TRIGGER_SAFETY_2(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSPSS_DSP_CORE_TRIGGER_SAFETY_DSP_TRIGGER_SAFETY_2_SHIFT)) & DSPSS_DSPSS_DSP_CORE_TRIGGER_SAFETY_DSP_TRIGGER_SAFETY_2_MASK)
/*! @} */

/*! @name DMA_READ_ADDR4 - Reference DMA Read Region */
/*! @{ */

#define DSPSS_DMA_READ_ADDR4_DMA_READ_START_ADDR_MASK (0x3FFFU)
#define DSPSS_DMA_READ_ADDR4_DMA_READ_START_ADDR_SHIFT (0U)
#define DSPSS_DMA_READ_ADDR4_DMA_READ_START_ADDR_WIDTH (14U)
#define DSPSS_DMA_READ_ADDR4_DMA_READ_START_ADDR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_READ_ADDR4_DMA_READ_START_ADDR_SHIFT)) & DSPSS_DMA_READ_ADDR4_DMA_READ_START_ADDR_MASK)

#define DSPSS_DMA_READ_ADDR4_DMA_READ_END_ADDR_MASK (0xFFFC0000U)
#define DSPSS_DMA_READ_ADDR4_DMA_READ_END_ADDR_SHIFT (18U)
#define DSPSS_DMA_READ_ADDR4_DMA_READ_END_ADDR_WIDTH (14U)
#define DSPSS_DMA_READ_ADDR4_DMA_READ_END_ADDR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_READ_ADDR4_DMA_READ_END_ADDR_SHIFT)) & DSPSS_DMA_READ_ADDR4_DMA_READ_END_ADDR_MASK)
/*! @} */

/*! @name DMA_ERROR_STATUS4 - DMA Error Status */
/*! @{ */

#define DSPSS_DMA_ERROR_STATUS4_DMA_ADDR_MISMATCH_WR_BUFFER_MASK (0x1U)
#define DSPSS_DMA_ERROR_STATUS4_DMA_ADDR_MISMATCH_WR_BUFFER_SHIFT (0U)
#define DSPSS_DMA_ERROR_STATUS4_DMA_ADDR_MISMATCH_WR_BUFFER_WIDTH (1U)
#define DSPSS_DMA_ERROR_STATUS4_DMA_ADDR_MISMATCH_WR_BUFFER(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_ERROR_STATUS4_DMA_ADDR_MISMATCH_WR_BUFFER_SHIFT)) & DSPSS_DMA_ERROR_STATUS4_DMA_ADDR_MISMATCH_WR_BUFFER_MASK)

#define DSPSS_DMA_ERROR_STATUS4_DMA_ADDR_MISMATCH_RD_BUFFER_MASK (0x2U)
#define DSPSS_DMA_ERROR_STATUS4_DMA_ADDR_MISMATCH_RD_BUFFER_SHIFT (1U)
#define DSPSS_DMA_ERROR_STATUS4_DMA_ADDR_MISMATCH_RD_BUFFER_WIDTH (1U)
#define DSPSS_DMA_ERROR_STATUS4_DMA_ADDR_MISMATCH_RD_BUFFER(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_ERROR_STATUS4_DMA_ADDR_MISMATCH_RD_BUFFER_SHIFT)) & DSPSS_DMA_ERROR_STATUS4_DMA_ADDR_MISMATCH_RD_BUFFER_MASK)

