zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_DSPSS.h
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE5_NUM_OF_DMA_REQ_PEND_MASK (0x3FC00U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE5_NUM_OF_DMA_REQ_PEND_SHIFT (10U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE5_NUM_OF_DMA_REQ_PEND_WIDTH (8U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE5_NUM_OF_DMA_REQ_PEND(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_HW_CTRL_DMA_REQ_RESPONSE5_NUM_OF_DMA_REQ_PEND_SHIFT)) & DSPSS_HW_CTRL_DMA_REQ_RESPONSE5_NUM_OF_DMA_REQ_PEND_MASK)
/*! @} */

/*! @name DSPSS_DSP_THREAD_INFO - Thread Status Info 0..Thread Status Info 3 */
/*! @{ */

#define DSPSS_DSPSS_DSP_THREAD_INFO_SDADC_XMEM_CURR_WR_PTR_MASK (0x3FFFU)
#define DSPSS_DSPSS_DSP_THREAD_INFO_SDADC_XMEM_CURR_WR_PTR_SHIFT (0U)
#define DSPSS_DSPSS_DSP_THREAD_INFO_SDADC_XMEM_CURR_WR_PTR_WIDTH (14U)
#define DSPSS_DSPSS_DSP_THREAD_INFO_SDADC_XMEM_CURR_WR_PTR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSPSS_DSP_THREAD_INFO_SDADC_XMEM_CURR_WR_PTR_SHIFT)) & DSPSS_DSPSS_DSP_THREAD_INFO_SDADC_XMEM_CURR_WR_PTR_MASK)

#define DSPSS_DSPSS_DSP_THREAD_INFO_WRAP_COUNT_MASK (0xC000U)
#define DSPSS_DSPSS_DSP_THREAD_INFO_WRAP_COUNT_SHIFT (14U)
#define DSPSS_DSPSS_DSP_THREAD_INFO_WRAP_COUNT_WIDTH (2U)
#define DSPSS_DSPSS_DSP_THREAD_INFO_WRAP_COUNT(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSPSS_DSP_THREAD_INFO_WRAP_COUNT_SHIFT)) & DSPSS_DSPSS_DSP_THREAD_INFO_WRAP_COUNT_MASK)

#define DSPSS_DSPSS_DSP_THREAD_INFO_CURR_FSM_STATE_MASK (0x3FF0000U)
#define DSPSS_DSPSS_DSP_THREAD_INFO_CURR_FSM_STATE_SHIFT (16U)
#define DSPSS_DSPSS_DSP_THREAD_INFO_CURR_FSM_STATE_WIDTH (10U)
#define DSPSS_DSPSS_DSP_THREAD_INFO_CURR_FSM_STATE(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSPSS_DSP_THREAD_INFO_CURR_FSM_STATE_SHIFT)) & DSPSS_DSPSS_DSP_THREAD_INFO_CURR_FSM_STATE_MASK)

#define DSPSS_DSPSS_DSP_THREAD_INFO_NUM_THREADS_IN_ACC_FIFO_MASK (0x3C000000U)
#define DSPSS_DSPSS_DSP_THREAD_INFO_NUM_THREADS_IN_ACC_FIFO_SHIFT (26U)
#define DSPSS_DSPSS_DSP_THREAD_INFO_NUM_THREADS_IN_ACC_FIFO_WIDTH (4U)
#define DSPSS_DSPSS_DSP_THREAD_INFO_NUM_THREADS_IN_ACC_FIFO(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSPSS_DSP_THREAD_INFO_NUM_THREADS_IN_ACC_FIFO_SHIFT)) & DSPSS_DSPSS_DSP_THREAD_INFO_NUM_THREADS_IN_ACC_FIFO_MASK)

#define DSPSS_DSPSS_DSP_THREAD_INFO_THREAD_ACC_FIFO_FULL_MASK (0x40000000U)
#define DSPSS_DSPSS_DSP_THREAD_INFO_THREAD_ACC_FIFO_FULL_SHIFT (30U)
#define DSPSS_DSPSS_DSP_THREAD_INFO_THREAD_ACC_FIFO_FULL_WIDTH (1U)
#define DSPSS_DSPSS_DSP_THREAD_INFO_THREAD_ACC_FIFO_FULL(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSPSS_DSP_THREAD_INFO_THREAD_ACC_FIFO_FULL_SHIFT)) & DSPSS_DSPSS_DSP_THREAD_INFO_THREAD_ACC_FIFO_FULL_MASK)

#define DSPSS_DSPSS_DSP_THREAD_INFO_THREAD_ACC_FIFO_OVF_MASK (0x80000000U)
#define DSPSS_DSPSS_DSP_THREAD_INFO_THREAD_ACC_FIFO_OVF_SHIFT (31U)
#define DSPSS_DSPSS_DSP_THREAD_INFO_THREAD_ACC_FIFO_OVF_WIDTH (1U)
#define DSPSS_DSPSS_DSP_THREAD_INFO_THREAD_ACC_FIFO_OVF(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSPSS_DSP_THREAD_INFO_THREAD_ACC_FIFO_OVF_SHIFT)) & DSPSS_DSPSS_DSP_THREAD_INFO_THREAD_ACC_FIFO_OVF_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group DSPSS_Register_Masks */

/*!
 * @}
 */ /* end of group DSPSS_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K39_DSPSS_H_) */
